Terraform plan for __production__
<details>
  <summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```hcl
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.policy will be created
  + resource "aws_iam_policy" "policy" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "github-policy"
      + path   = "/"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Statement = [
                          + {
                              + Action   = [
                                  + "iam:CreatePolicy",
                                  + "iam:GetUserPolicy",
                                  + "iam:UpdateUser",
                                  + "iam:PutUserPolicy",
                                  + "iam:DeleteUserPolicy",
                                  + "iam:AttachUserPolicy",
                                  + "iam:DeletePolicy",
                                  + "iam:GetUser",
                                  + "iam:DetachUserPolicy",
                                ]
                              + Effect   = "Allow"
                              + Resource = [
                                  + "arn:aws:iam::278755489513:user/*",
                                  + "arn:aws:iam::278755489513:policy/*",
                                ]
                            },
                        ]
                      + Version   = "2012-10-17"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_iam_user.user will be created
  + resource "aws_iam_user" "user" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "github"
      + path          = "/"
      + unique_id     = (known after apply)
    }

  # aws_iam_user_policy_attachment.test-attach will be created
  + resource "aws_iam_user_policy_attachment" "test-attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "github"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

Plan generated in [plan #23](https://github.com/mkohlmyr/actionable/actions/runs/630760620)